waveshareteam/ESP32-S3-Touch-LCD-5/examples/ESP-IDF/05_IO_Test/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_HZ=500
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_EXAMPLE_DOUBLE_FB=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_I2C_MASTER_SCL=9
CONFIG_I2C_MASTER_SDA=8

CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_USE_USER_DATA=y
CONFIG_LV_USE_CHART=y
CONFIG_LV_USE_PERF_MONITOR=n

CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y

CONFIG_LV_USE_DEMO_WIDGETS=y
